[
  {
    "body": "‘My power is through my words': Guelph Indigenous and disability advocate Mike (O’dah ziibing) Ashkewe",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/5/27/52743ebd-7c90-5ae6-a0fe-cea725bf51b0/646d43978233b.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/my-power-is-through-my-words-guelph-indigenous-and-disability-advocate-mike-o-dah-ziibing/article_4b78217c-2314-535d-9fe3-e9b03032c496.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.Mike (O’dah ziibing) Ashkewe is a community activist in the city of Guelph and a freelance writer for the Guelph Mercury Tribune. He is a Sixties Scoop survivor who has written about discovering his sense of belonging.He is known as an independent media producer, writer and broadcaster and the executive producer of This Week in Geek.WHAT DO YOU DO? WHAT IS YOUR CALLING?“Most of the stuff I do here in Guelph, and provincially and federally, is in trying to get people to talk, to create conversations, to create bridges between communities. Not just to get Indigenous groups to talk between each other, but to gather other community members and build something for the future,” Ashkewe said. “You see so many different perspectives and it’s wanting to uplift those voices so they can be heard by those in power to hopefully make those important changes.”WHY IS THAT YOUR PASSION?“One of the big things I believe is there has to be a melding of the old ways and the new ways,” said Ashkewe. I found out as part of my clan, which is Clan Bear, …, that it includes diplomats and politicians — that also means facilitators who are interested in creating conversations.”“I was gifted recently a snapping turtle necklace, and I was told I was powerful in snapping turtle medicine. My power is through my words,” he said. “I figure, the more people I can get talking, that creates something better than one voice.”WHAT DRIVES YOU?“It’s the fact that I never know what tomorrow is going to bring,” said Ashkewe. “For me, it’s always, what’s the next adventure?”WHAT IS THE BEST ADVICE YOU HAVE RECEIVED?“Be teachable,” he said. “Always be learning, always be listening, be willing to be wrong, be willing to be vulnerable.”IF A NON-INDIGENOUS CANADIAN COULD LEARN ABOUT ONE PART OF INDIGENOUS HISTORY THIS MONTH, WHAT SHOULD THAT BE?“From my own personal experience, I would say the Sixties Scoop,\" said Ashkewe. \"That’s where our language and culture was forcibly taken from us, because we were taken from our families.”"
  },
  {
    "body": "Woman dies after Brampton house fire, man and child sent to trauma centres in critical condition",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/0/4f/04f69e18-f41a-51f2-bd46-fbeb16df0eec/647b51fd7422d.image.jpg?resize=200%2C150",
    "url": "https://www.bramptonguardian.com/news/woman-dies-after-brampton-house-fire-man-and-child-sent-to-trauma-centres-in-critical/article_02b7c14c-c6cb-54af-809f-60cdad113907.html",
    "description": "A woman has died and an adult man and a child remain in critical condition in a hospital following a house fire in Brampton late Friday night.In a tweet, Peel police said dispatchers received a call of a house fire in the area of Jade Crescent and Jayfield Road just before 11 p.m.Three people — two adults and a child — were sent to a hospital in life-threatening condition and both Peel police and Brampton Fire and Emergency Services (BFES) Chief Bill Boyes confirmed an adult woman succumbed to her injuries in hospital.An adult man and a child have been sent to trauma centres and remain in critical condition.“On behalf of @BramptonFireES @BPFFA1068, our thoughts & prayers go out to all the friends and family impacted by the Jade Crescent fire. One adult female has died and one adult male & child are in hospital in critical condition. @ONFireMarchal investigation is underway,” Boyes wrote in a tweet on the morning of Saturday June 3. On behalf of @BramptonFireES @BPFFA1068, our thoughts & prayers go out to all the friends & family impacted by the Jade Crescent fire. One adult female has died & one adult male & child are in hospital in critical condition. @ONFireMarshal investigation is underway. https://t.co/aWkCBBdhBR pic.twitter.com/MfvIC55rTe BFES said the fire was declared under control just after 12:15 a.m. on Saturday morning and that the Ontario Fire Marshal has commenced an investigation.Access to Jade Crescent remained limited as of Saturday morning and BFES firefighters remain on scene on fire watch."
  },
  {
    "body": "Brampton celebrating Bike Month with tours and events",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/d/f6/df660c59-dbf5-5f1b-8472-d1303c3f54f5/6478cf154ae44.image.jpg?resize=200%2C200",
    "url": "https://www.bramptonguardian.com/news/brampton-celebrating-bike-month-with-tours-and-events/article_b65331c5-412f-5282-a856-a4c7598d9d33.html",
    "description": "The City of Brampton is celebrating Bike Month with a series of events and tours.COMMUNITY BIKE RIDESCommunity rides are a series of free casual cycling tours held in Brampton through the summer months. Led by citizen volunteer members of the Active Transportation Advisory Committee, these group rides provide opportunities for residents and visitors to explore Brampton on their bicycles and meet other cyclists.During Bike Month, Community Bike Rides take place on June 6, 11, 20, and 25.BIKE THE CREEKBike the Creek aims to raise awareness about the benefits of biking and the importance of active transportation in building a healthy community.Established in 2014, Bike the Creek is planned with partners Bike Brampton, Toronto and Region Conservation Authority (TRCA), the City of Brampton, the City of Mississauga, and the Town of Caledon. The event attracts more than 1,000 cycling enthusiasts of all ages and engages more than 50 volunteers from the community.Bike the Creek takes place on June 10.“Cycling is something we all benefit from in different ways,” said Mayor Patrick Brown.“As a viable transportation option and an activity that helps keep us fit and reduces our dependency on cars, it’s important to create Active Transportation Networks that encourage cycling and a greener, healthier future.” Brown added.THE ACTIVE TRANSPORTATION MASTER PLANThe Active Transportation Master Plan includes the implementation strategy for building a connected cycling and pedestrian network across the city and connecting neighbouring municipalities to enable safer, more convenient travel by non-motorized modes, and to encourage cycling as a viable means of transportation for both recreational and utilitarian purposes for the general public.CYCLING TIPS1. Ensure your bike is in working order. Have it tuned up by a professional or learn how to do it yourself at Different Spokes – Brampton’s Bike Hub. Sign up to become a member (for free!) and book your appointment.2. Be sure to have a good U-lock, a bell, front and rear lights and a well-fitting helmet. If possible, use panniers (bike bags) and fenders to protect yourself from puddle splashes.3. Learn the Rules of the Road. Understand what types of cycling infrastructure Brampton has here and review Peel's Cyclist Handbooks to understand how to bike safely within the city.4. Plan out your route. Brampton has a variety of trails, neighbourhood paths and shortcuts for quicker and more comfortable trips than your typical driving route. Check out the Brampton Cycling Map and Google Street View to plan your ride. Explore the use of transit. For longer trips, you can combine cycling and transit. Brampton Transit, YRT, MiWay and GO Transit allow bikes on their buses and trains. Also, see if leaving your bike at a bus terminal or bike racks along a bus route works for you. Check out how to load a bike on a bus here.5. Dress for the weather. Check the forecast before biking; that way, there will be no surprises. You can bike in gym clothes and change at work or opt for your regular work attire and cycle a bit slower. Bring extra clothes and toiletries to your workplace just in case. On colder days, dress in layers. Practice. Instead of aiming to bike to work every day, start biking to work once a week to get accustomed to the change in schedule."
  },
  {
    "body": "VIDEO: Region of Peel gives behind-the-scenes view on what residents can expect during water main construction",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/8/e0/8e074428-50e2-5290-bb00-2531b4f9beaf/646d3855aefbf.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/video-region-of-peel-gives-behind-the-scenes-view-on-what-residents-can-expect-during/article_d627570d-6c6c-5ce4-8f6d-ffa3c7e680b2.html",
    "description": "A video by the Region of Peel provides residents a behind-the-scenes view of what happens when a water main construction is planned for a neighbourhood.The municipal water mains (underground pipes) in Brampton, Caledon and Mississauga neighbourhoods are maintained by the Region of Peel.These water mains bring tap water from a treatment plant to homes and businesses.The \"Watermain Construction In Your Neighbourhood\" video goes behind the scenes to help residents understand what happens when these pipes are repaired or replaced.The video outlines the steps the region takes to let residents know what happens before, during and after construction, including how residents will be notified, what they can do to prepare for construction, what residents would typically see when crews are working in their neighbourhood and how driveways, sidewalks and sod are repaired once construction is finished.The video also answers the most-commonly asked questions about construction and its effect on traffic, parking, water pressure and waste collection.Residents can learn more about construction projects in their area, including an interactive map, and sign up for email updates by visiting https://peelregion.ca/construction/."
  },
  {
    "body": "Cat found in cardboard box in Brampton returned to original rescuers in Winnipeg",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/9/76/976e049e-a9b7-5a02-8e72-e09f19339d03/64766c4d3ae35.image.jpg?resize=200%2C146",
    "url": "https://www.bramptonguardian.com/news/cat-found-in-cardboard-box-in-brampton-returned-to-original-rescuers-in-winnipeg/article_79dcb717-c5b3-5b3d-bba8-2823b7d2b9d3.html",
    "description": "Oh, the stories this cat could tell.An orange cat found inside a cardboard box near a busy Brampton intersection has been flown back to Manitoba to be reunited with the family that originally found him locked in a shed nearly a decade ago.DJ, the kitty, came to Brampton Animal Services on May 1 after someone found him inside a cardboard box near the intersection of Williams Parkway and Grenoble Boulevard.Upon giving him a checkup, staff found a tattoo inside his ear, which is uncommon in Ontario since the rise in micro chipping.The practice remains more common, however, in Canada’s western provinces.“We started calling vet clinics and rescues,” said Mike Mulick, manager of animal services for the City of Brampton.Staff managed to track the tattoo down to a rescue in Manitoba, and learned the cat had been re-homed to a couple in Mississauga back in 2014.“That was the last that they knew of him,” Mulick said, explaining that through more research, they learned that he had been re-homed at least once more before being found inside the box.“He’s gotten around,” Mulick said, adding that staff managed to connect with the couple that originally found him in Winnipeg before bringing him to the rescue.He said that in 2014, they found him locked in a shed and nursed him back to health before bringing him to the facility.While they couldn’t adopt him at the time, the pair are now in a position to give him a home.With the help of a volunteer organization called Canadian Wings of Rescue, DJ was brought to the Brampton Flight Centre on May 12 and loaded onto a single propeller airplane before flying out.Mulick said the family has sent photos and updates on DJ, who is settling in.“He’s happy and content and doesn’t have to worry about where he’s going to end up,” Mulick said."
  },
  {
    "body": "'My heart will always be with my community': Kelly LaRocca is now in her fifth term as chief of the Mississaugas of Scugog Island First Nation",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/e/a1/ea1bfca6-870b-5746-b3b0-f73ecfac5042/646d379f7a419.image.jpg?resize=200%2C120",
    "url": "https://www.bramptonguardian.com/news/my-heart-will-always-be-with-my-community-kelly-larocca-is-now-in-her-fifth/article_1c35df74-6179-5990-8351-65351a378346.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.As Kelly LaRocca worked toward completing her law degree, she looked forward to returning home to serve her community — the Mississaugas of Scugog Island First Nation.To her surprise, however, LaRocca’s uncle, Gary Edgar, himself a former chief of the MSIFN, advised her that the timing wasn’t right just yet.“You need to gain a broader frame of reference and experience in the mainstream community and learn about how things work outside of the first nation. Flex your academic muscles and put them to good use in the mainstream so that you can build your skills and have that experience come and benefit your community later,” recalled LaRocca of that conversation with Edgar. “I think that was the best bit of advice he could have given me. To this day, I’m very thankful for it.”Going on to become an insurance defence and class-action litigation lawyer, LaRocca entered politics in 2008 as a Scugog Island First Nation councillor before being elected as chief in 2013. She is now in her fifth term as chief, serving as an advocate for her community, spokesperson, entrepreneur to spur economic growth for her First Nation and cultural leader.“My heart will always be with my community, my ancestral connections are part of this community, and so that plays a significant role in how passionate I am about Indigenous issues and about Scugog First Nation,” she said of serving the MSIFN.“I lost my mum in 2003 and I wanted to do my best to honour her legacy, so that’s a big part of why I do what I do. But also, I just feel a connection to this geographic place and space and now I have children in the community who will be the beneficiaries of all the hard work of previous leadership and community decisions,” continued LaRocca. “I want to make a better place for not only my children, but the children at large.”The Indigenous population at large represents a “celebration of human resiliency,” added the MSIFN chief.“I’m very proud to be part of the Indigenous community because they’ve survived against all odds and, it’s more than just survival, it’s about picking up culture, being proud of it and ... applying culture as healing and I think it’s showing in the successes of our communities and it’s showing in the promise and hope of our youth,” said LaRocca."
  },
  {
    "body": "SIU investigating death of a man in Etobicoke following Peel police operation",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/3/af/3af93ffc-a254-5957-b9b8-b15c6d68110c/647a5b697f2e9.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/siu-investigating-death-of-a-man-in-etobicoke-following-peel-police-operation/article_9cdaad8e-298e-5fd6-a440-9bda4339e69f.html",
    "description": "Ontario's Special Investigations Unit is investigating the circumstances surrounding the death of a man found at a townhouse in the City of Etobicoke.The investigative agency said in a media release that as per the latest update, Peel Regional Police breached the door of the apartment at around 2 a.m. at 551 The West Mall, executing a search warrant in the area just beyond the Toronto/Mississauga border.The release added that the warrant was related to a domestic violence investigation.SIU further stated the Peel police officers located the man as deceased, and pronounced death at the scene.The deceased man was identified as 39-year-old Kyle Andrews by his next of kin, the SIU release reads.Four investigators and one forensic investigator have been assigned to the case. The autopsy is scheduled for Sunday, June 4, the SIU said.Peel police, while confirming the incident, said tactical officers executed a search warrant on a residential unit using specialized breaching equipment to make entry. According to police, once inside the unit, officers located an adult male who was deceased.No officers discharged their service firearm during the operation, police said.The SIU was subsequently contacted and has since invoked its mandate, and as such, no further details can be provided by Peel Regional Police at this time.While the operation took place within the City of Toronto, Toronto Police Service members were not involved, Peel police said.The SIU is urging anyone who may have information about this investigation, including video or photos, to contact the lead investigator at 1-800-787-8529 or online at siu.on.ca/en/appeals.php."
  },
  {
    "body": "Facebook and Instagram are about to start blocking news for random Canadians. Here’s what it will look like if you’re targeted",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/d/41/d415d988-ec4e-5998-92ac-4ddeab69bea8/647a47bb1b902.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/facebook-and-instagram-are-about-to-start-blocking-news-for-random-canadians-here-s-what/article_965b3149-cbd3-5a18-8044-674b897e6b25.html",
    "description": "OTTAWA—Meta, the tech giant that owns Facebook and Instagram, will soon start blocking the sharing and posting of news content for some Canadians on those platforms as part of a testing strategy that could become permanent — and rolled out nationwide — if Ottawa’s online news bill passes unchanged.In the coming days, Meta will introduce the tests in preparation for the potential passage of Bill C-18, or the Online News Act, which it opposes.The bill would force digital giants like Meta and Google to enter into deals with Canadian media publishers for directing their users to and sharing online news. The federal government has framed the bill as an attempt to create a more balanced relationship between news outlets and the digital platforms, which Ottawa says unfairly dominate the digital advertising market. Torstar, which owns the Toronto Star, supports the bill, and currently has deals with both platforms for news sharing.Meta’s move follows a similar tactic employed by Google earlier this year, which saw the global search giant quietly launch a test that filtered out Canadian and international news content for some of its users in Canada.For “several weeks” — Meta won’t reveal the precise duration of the test — a “small percentage” of Canadian users will be blocked from viewing, sharing or posting certain news content on Facebook and Instagram.“When a big tech company, whatever the size is, the amount of money and the powerful lawyers they have, they come here and they tell us, if you don’t do this or that, then I’m pulling the plug — that’s a threat and that is unacceptable,” Heritage Minister Pablo Rodriguez said in a statement in response to the news.“I never did anything because I was afraid of a threat, and I will never do it.”Here’s what else Canadians can expect, and why Meta is taking the controversial step.What will this look like for me?Meta says one to five per cent of Canadian Facebook and Instagram users will be chosen at random and enrolled in the tests. The company won’t disclose the total number of Canadians set to be affected. It says 24 million people in Canada use its apps — which include Facebook, Instagram and WhatsApp — but would not break down those numbers.If someone is selected, they won’t be told in advance; they’ll only find out when they try to share news content on their profile and receive a notification informing them they cannot do so.Affected users also won’t be barred from sharing every news story they want to post. Instead, they’ll be blocked from sharing content from specific news publishers.Meta told the Star that selected users on the platforms could experience the news ban differently, and that the number of people affected could fluctuate over the course of the test.What does this mean for news outlets?News accounts affected by the test will also be chosen at random, but they’ll be plucked from a list of outlets that match the criteria outlined in the bill over what constitutes an “eligible news business.”Those are outlets that have been deemed a “qualified Canadian journalism organization” as defined under the Income Tax Act and that produce “news content of public interest.” Among other criteria, eligible outlets should employ two or more journalists within Canada and should operate in Canada.Rachel Curran, Meta Canada’s head of public policy, says that means international news publishers that partially operate in Canada could also be included the test.“The New York Times or the Wall Street Journal or the BBC or any of those outlets that have a presence in Canada … their content will also not be viewable or shareable by users in Canada,” she told the Star.When the test commences, the profiles for news pages in Canada won’t be pulled down, and publishers won’t be restricted from posting content. The company will instead restrict “the viewability and shareability” of news content on those pages for any users targeted in the test.Tell me more about this bill — and why Meta is pushing backA key argument underpinning the government’s motivation for introducing C-18 last spring is that it says the web giants are “gatekeepers” that “derive significant financial benefit for their operations in Canada.”Ottawa has also been critical of Meta and Google’s attempts to restrict news content online in response to similar legislative moves in other countries. Canada’s bill is based on Australia’s News Media Bargaining Code, which saw Facebook pull news from its platform in that country for seven days. MPs and senators, meanwhile, have questioned whether removing trusted news sources from online platforms would allow misinformation to spread unchecked.Meta and Google have argued for months that news content only accounts for a small percentage of the queries — and revenue generated — on their platforms.“News content represents less than three per cent of what’s in-feed,” Curran said.Meta says that rather than siphoning advertising dollars away from news publishers, it sends more than a billion clicks to their sites in a year, representing hundreds of millions in revenue.The company has put forward a series of amendments it wants to see backed by senators and MPs as the bill enters what could be its final weeks of study. Some of those changes include altering definitions of what constitutes news content and how it is made available online.“We don’t want to pre-empt the Senate’s work. We’re appreciative, very appreciative of the fact that I think they’re taking a close look at amendments and really doing a policy dive into the bill,” Curran said.“This is really about preparing for the possibility of Bill C-18 passing substantively as drafted, and in order to prepare properly for that passage, we have to start testing now.”\n"
  },
  {
    "body": "‘My power is through my words': Guelph Indigenous and disability advocate Mike (O’dah ziibing) Ashkewe",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/1/c1/1c1a7f82-0b5e-52a6-869f-889e41797ccc/646d43977f982.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/my-power-is-through-my-words-guelph-indigenous-and-disability-advocate-mike-o-dah-ziibing/article_3dbf6a8a-1b2b-50c8-a7fc-14e5107a8b83.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.Mike (O’dah ziibing) Ashkewe is a community activist in the city of Guelph and a freelance writer for the Guelph Mercury Tribune. He is a Sixties Scoop survivor who has written about discovering his sense of belonging.He is known as an independent media producer, writer and broadcaster and the executive producer of This Week in Geek.WHAT DO YOU DO? WHAT IS YOUR CALLING?“Most of the stuff I do here in Guelph, and provincially and federally, is in trying to get people to talk, to create conversations, to create bridges between communities. Not just to get Indigenous groups to talk between each other, but to gather other community members and build something for the future,” Ashkewe said. “You see so many different perspectives and it’s wanting to uplift those voices so they can be heard by those in power to hopefully make those important changes.”WHY IS THAT YOUR PASSION?“One of the big things I believe is there has to be a melding of the old ways and the new ways,” said Ashkewe. I found out as part of my clan, which is Clan Bear, …, that it includes diplomats and politicians — that also means facilitators who are interested in creating conversations.”“I was gifted recently a snapping turtle necklace, and I was told I was powerful in snapping turtle medicine. My power is through my words,” he said. “I figure, the more people I can get talking, that creates something better than one voice.”WHAT DRIVES YOU?“It’s the fact that I never know what tomorrow is going to bring,” said Ashkewe. “For me, it’s always, what’s the next adventure?”WHAT IS THE BEST ADVICE YOU HAVE RECEIVED?“Be teachable,” he said. “Always be learning, always be listening, be willing to be wrong, be willing to be vulnerable.”IF A NON-INDIGENOUS CANADIAN COULD LEARN ABOUT ONE PART OF INDIGENOUS HISTORY THIS MONTH, WHAT SHOULD THAT BE?“From my own personal experience, I would say the Sixties Scoop,\" said Ashkewe. \"That’s where our language and culture was forcibly taken from us, because we were taken from our families.”Top stories delivered to your inbox."
  },
  {
    "body": "VIDEO: Region of Peel gives behind-the-scenes view on what residents can expect during water main construction",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/b/d8/bd8226d4-6ff7-503c-9f37-4423dd4e85c0/646d38557b543.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/video-region-of-peel-gives-behind-the-scenes-view-on-what-residents-can-expect-during/article_7203a30f-e453-5548-aef6-b46e221e639a.html",
    "description": "A video by the Region of Peel provides residents a behind-the-scenes view of what happens when a water main construction is planned for a neighbourhood.The municipal water mains (underground pipes) in Brampton, Caledon and Mississauga neighbourhoods are maintained by the Region of Peel.These water mains bring tap water from a treatment plant to homes and businesses.The \"Watermain Construction In Your Neighbourhood\" video goes behind the scenes to help residents understand what happens when these pipes are repaired or replaced.The video outlines the steps the region takes to let residents know what happens before, during and after construction, including how residents will be notified, what they can do to prepare for construction, what residents would typically see when crews are working in their neighbourhood and how driveways, sidewalks and sod are repaired once construction is finished.The video also answers the most-commonly asked questions about construction and its effect on traffic, parking, water pressure and waste collection.Residents can learn more about construction projects in their area, including an interactive map, and sign up for email updates by visiting https://peelregion.ca/construction/.Top stories delivered to your inbox."
  },
  {
    "body": "Toronto Rock temporarily relocating to Mississauga as home arena in Hamilton undergoes renovation",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/e/e1/ee1e6d23-2035-50d8-826e-63868ff3efc9/64791b0491145.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/toronto-rock-temporarily-relocating-to-mississauga-as-home-arena-in-hamilton-undergoes-renovation/article_1159c84a-8905-5edc-a4cd-c05b3d4418b8.html",
    "description": "The Toronto Rock have announced they will be playing their December home games at FirstOntario Centre in Hamilton, followed by a temporary relocation to Mississauga.Upon the closure of the Rock’s home arena, they will play the rest of their regular season games and playoffs at Paramount Fine Foods Centre (PFFC).FirstOntario Centre renovations will begin in January 2024 with a 20-month construction timeline. This displaces the Rock from their Hamilton home for almost two seasons, with a return home expected for the 2025-26 National Lacrosse League (NLL) campaign.“We are extremely excited to have the opportunity to play our December 2023 home games at our home in Hamilton,” Toronto Rock owner president and general manager Jamie Dawick said in a news release.“We know there will be some challenges with relocating games mid-season; however, we hope to replicate the same Rock City experience and energy in Mississauga that our fans currently enjoy in Hamilton.”Rock City Builders Club season members will be contacted soon to confirm their seats at PFFC and make any account changes before the auto-renewal process begins.With a smaller seating capacity at PFFC, there will be a cap on season memberships so that a small number of single-game and group tickets can be sold.“We are thrilled that Mississauga and our Paramount Fine Foods Centre will be the Toronto Rock’s home away from home for parts of their next two seasons,” said Mississauga Mayor Bonnie Crombie.“Sport has a unique way of bringing people together. It transcends language and culture and is truly a unifying force for good, especially in a diverse city like Mississauga.”For ticket information, contact a Toronto Rock account executive by phone at 416-596-3075, by email at tickets@torontorock.com or visit torontorock.com.Top stories delivered to your inbox."
  },
  {
    "body": "'My heart will always be with my community': Kelly LaRocca is now in her fifth term as chief of the Mississaugas of Scugog Island First Nation",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/f/38/f382e22f-6740-5bbb-aad1-9e41bc621eaa/646d379f83350.image.jpg?resize=200%2C120",
    "url": "https://www.mississauga.com/news/my-heart-will-always-be-with-my-community-kelly-larocca-is-now-in-her-fifth/article_85c1b977-984c-5297-b826-9d6935e660c8.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.As Kelly LaRocca worked toward completing her law degree, she looked forward to returning home to serve her community — the Mississaugas of Scugog Island First Nation.To her surprise, however, LaRocca’s uncle, Gary Edgar, himself a former chief of the MSIFN, advised her that the timing wasn’t right just yet.“You need to gain a broader frame of reference and experience in the mainstream community and learn about how things work outside of the first nation. Flex your academic muscles and put them to good use in the mainstream so that you can build your skills and have that experience come and benefit your community later,” recalled LaRocca of that conversation with Edgar. “I think that was the best bit of advice he could have given me. To this day, I’m very thankful for it.”Going on to become an insurance defence and class-action litigation lawyer, LaRocca entered politics in 2008 as a Scugog Island First Nation councillor before being elected as chief in 2013. She is now in her fifth term as chief, serving as an advocate for her community, spokesperson, entrepreneur to spur economic growth for her First Nation and cultural leader.“My heart will always be with my community, my ancestral connections are part of this community, and so that plays a significant role in how passionate I am about Indigenous issues and about Scugog First Nation,” she said of serving the MSIFN.“I lost my mum in 2003 and I wanted to do my best to honour her legacy, so that’s a big part of why I do what I do. But also, I just feel a connection to this geographic place and space and now I have children in the community who will be the beneficiaries of all the hard work of previous leadership and community decisions,” continued LaRocca. “I want to make a better place for not only my children, but the children at large.”The Indigenous population at large represents a “celebration of human resiliency,” added the MSIFN chief.“I’m very proud to be part of the Indigenous community because they’ve survived against all odds and, it’s more than just survival, it’s about picking up culture, being proud of it and ... applying culture as healing and I think it’s showing in the successes of our communities and it’s showing in the promise and hope of our youth,” said LaRocca.Top stories delivered to your inbox."
  },
  {
    "body": "KEEP COOL: Mississauga spray pads open, outdoor pools to open later this month",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/a/35/a3511a50-f30f-5b6e-9a6c-b3a01f0b97da/647a33cf6a63d.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/keep-cool-mississauga-spray-pads-open-outdoor-pools-to-open-later-this-month/article_f431f316-d68a-5c10-823c-3d978597e2be.html",
    "description": "The City of Mississauga has opened its outdoor spray pads just in time for the heat and sunshine.The city also announced the opening date of outdoor pools in a news release on Friday, June 2.SPRAY PADSFamilies can enjoy any of the city’s 32 spray pads through to September, weather permitting. Spray pads open daily at 9 a.m. and are unsupervised. Plan your day accordingly and use the online map to find a spray pad near you.Visiting Celebration Square? The wading pool is open from 10 a.m. to 9 p.m. until Labour Day, and 10 a.m. to 8 p.m. after Labour Day (times adjusted as per daylight hours).INDOOR POOLSThe city has many indoor pools that operate year-round.Indoor pools at Burhamthorpe Community Centre and Carmen Corbasson Community Centre are closed for renovation.OUTDOOR POOLSAll outdoor pools will open for the summer season on Saturday, June 17 (weather permitting).Pre-season: June 17 to 30 — weather permitting.Regular season: July 1 to Sept. 3.All indoor pools will be closed on Canada Day, July 1. Outdoor pools will be open. Residents are encouraged to check with their local pool to confirm holiday swim schedules.REMINDERThe city is advising residents to stay hydrated, apply sun protection, wear light clothing and sanitize frequently in public settings.For more on swimming in the city, check mississauga.ca/recreation.Top stories delivered to your inbox."
  },
  {
    "body": "SIU investigating death of a man in Etobicoke following Peel police operation",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/8/6b/86bf8c13-883e-5748-b990-b269b49a584c/647a5b69769a8.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/siu-investigating-death-of-a-man-in-etobicoke-following-peel-police-operation/article_8282ba38-59f3-52ba-9244-14cf68832605.html",
    "description": "Ontario's Special Investigations Unit is investigating the circumstances surrounding the death of a man found at a townhouse in the City of Etobicoke.The investigative agency said in a media release that as per the latest update, Peel Regional Police breached the door of the apartment at around 2 a.m. at 551 The West Mall, executing a search warrant in the area just beyond the Toronto/Mississauga border.The release added that the warrant was related to a domestic violence investigation.SIU further stated the Peel police officers located the man as deceased, and pronounced death at the scene.The deceased man was identified as 39-year-old Kyle Andrews by his next of kin, the SIU release reads.Four investigators and one forensic investigator have been assigned to the case. The autopsy is scheduled for Sunday, June 4, the SIU said.Peel police, while confirming the incident, said tactical officers executed a search warrant on a residential unit using specialized breaching equipment to make entry. According to police, once inside the unit, officers located an adult male who was deceased.No officers discharged their service firearm during the operation, police said.The SIU was subsequently contacted and has since invoked its mandate, and as such, no further details can be provided by Peel Regional Police at this time.While the operation took place within the City of Toronto, Toronto Police Service members were not involved, Peel police said.The SIU is urging anyone who may have information about this investigation, including video or photos, to contact the lead investigator at 1-800-787-8529 or online at siu.on.ca/en/appeals.php.Top stories delivered to your inbox."
  },
  {
    "body": "Facebook and Instagram are about to start blocking news for random Canadians. Here’s what it will look like if you’re targeted",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/d/c9/dc998075-8e8b-56f4-9afc-aefc157824bb/647a47bb1e88e.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/facebook-and-instagram-are-about-to-start-blocking-news-for-random-canadians-here-s-what/article_8b19abbb-ce5d-55d1-a261-dbee0af36c05.html",
    "description": "OTTAWA—Meta, the tech giant that owns Facebook and Instagram, will soon start blocking the sharing and posting of news content for some Canadians on those platforms as part of a testing strategy that could become permanent — and rolled out nationwide — if Ottawa’s online news bill passes unchanged.In the coming days, Meta will introduce the tests in preparation for the potential passage of Bill C-18, or the Online News Act, which it opposes.The bill would force digital giants like Meta and Google to enter into deals with Canadian media publishers for directing their users to and sharing online news. The federal government has framed the bill as an attempt to create a more balanced relationship between news outlets and the digital platforms, which Ottawa says unfairly dominate the digital advertising market. Torstar, which owns the Toronto Star, supports the bill, and currently has deals with both platforms for news sharing.Meta’s move follows a similar tactic employed by Google earlier this year, which saw the global search giant quietly launch a test that filtered out Canadian and international news content for some of its users in Canada.For “several weeks” — Meta won’t reveal the precise duration of the test — a “small percentage” of Canadian users will be blocked from viewing, sharing or posting certain news content on Facebook and Instagram.“When a big tech company, whatever the size is, the amount of money and the powerful lawyers they have, they come here and they tell us, if you don’t do this or that, then I’m pulling the plug — that’s a threat and that is unacceptable,” Heritage Minister Pablo Rodriguez said in a statement in response to the news.“I never did anything because I was afraid of a threat, and I will never do it.”Here’s what else Canadians can expect, and why Meta is taking the controversial step.What will this look like for me?Meta says one to five per cent of Canadian Facebook and Instagram users will be chosen at random and enrolled in the tests. The company won’t disclose the total number of Canadians set to be affected. It says 24 million people in Canada use its apps — which include Facebook, Instagram and WhatsApp — but would not break down those numbers.If someone is selected, they won’t be told in advance; they’ll only find out when they try to share news content on their profile and receive a notification informing them they cannot do so.Affected users also won’t be barred from sharing every news story they want to post. Instead, they’ll be blocked from sharing content from specific news publishers.Meta told the Star that selected users on the platforms could experience the news ban differently, and that the number of people affected could fluctuate over the course of the test.What does this mean for news outlets?News accounts affected by the test will also be chosen at random, but they’ll be plucked from a list of outlets that match the criteria outlined in the bill over what constitutes an “eligible news business.”Those are outlets that have been deemed a “qualified Canadian journalism organization” as defined under the Income Tax Act and that produce “news content of public interest.” Among other criteria, eligible outlets should employ two or more journalists within Canada and should operate in Canada.Rachel Curran, Meta Canada’s head of public policy, says that means international news publishers that partially operate in Canada could also be included the test.“The New York Times or the Wall Street Journal or the BBC or any of those outlets that have a presence in Canada … their content will also not be viewable or shareable by users in Canada,” she told the Star.When the test commences, the profiles for news pages in Canada won’t be pulled down, and publishers won’t be restricted from posting content. The company will instead restrict “the viewability and shareability” of news content on those pages for any users targeted in the test.Tell me more about this bill — and why Meta is pushing backA key argument underpinning the government’s motivation for introducing C-18 last spring is that it says the web giants are “gatekeepers” that “derive significant financial benefit for their operations in Canada.”Ottawa has also been critical of Meta and Google’s attempts to restrict news content online in response to similar legislative moves in other countries. Canada’s bill is based on Australia’s News Media Bargaining Code, which saw Facebook pull news from its platform in that country for seven days. MPs and senators, meanwhile, have questioned whether removing trusted news sources from online platforms would allow misinformation to spread unchecked.Meta and Google have argued for months that news content only accounts for a small percentage of the queries — and revenue generated — on their platforms.“News content represents less than three per cent of what’s in-feed,” Curran said.Meta says that rather than siphoning advertising dollars away from news publishers, it sends more than a billion clicks to their sites in a year, representing hundreds of millions in revenue.The company has put forward a series of amendments it wants to see backed by senators and MPs as the bill enters what could be its final weeks of study. Some of those changes include altering definitions of what constitutes news content and how it is made available online.“We don’t want to pre-empt the Senate’s work. We’re appreciative, very appreciative of the fact that I think they’re taking a close look at amendments and really doing a policy dive into the bill,” Curran said.“This is really about preparing for the possibility of Bill C-18 passing substantively as drafted, and in order to prepare properly for that passage, we have to start testing now.”\nTop stories delivered to your inbox."
  },
  {
    "body": "Mississauga Mayor Bonnie Crombie's motion requesting national anthem change deferred",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/a/db/adb6644e-293c-55f8-bd78-830290cda609/647a4ce246fcb.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/council/mississauga-mayor-bonnie-crombies-motion-requesting-national-anthem-change-deferred/article_db4c2286-e1ef-5dc3-803a-fe2bfcba0597.html",
    "description": "Mississauga city council has opted to defer a motion that would request a change to the national anthem.The motion, which was put forward by Mississauga Mayor Bonnie Crombie, was deferred Wednesday, May 31, after some councillors expressed concerns about it.If approved, Crombie’s motion would have seen a letter sent to the federal government asking for the anthem lyrics to change from “our home and native land” to “our home on native land.”The proposed change followed Canadian singer Jully Black using that phrasing at the NBA All-Star game earlier this year, a move the motion said was “hailed by Indigenous Peoples across Canada as an act of reconciliation and a speaking of the truth.”At the May 31 council meeting, Crombie said the motion was meant to “spark conversation” on the eve of National Indigenous History Month. Councillors received many messages both for and against the proposed change.“I think now is the right time to pause, and allow this council to consult with our residents on their support for this motion and bring it back at a later time,” she said.“O Canada” was penned by Quebec judge and poet Robert Stanley Weir and was last officially changed in 2018 when the Senate endorsed an earlier House of Commons vote to change the lyrics “in all thy sons command” to “in all of us command.”The 2018 change followed a private member’s bill from Liberal MP Mauril Belanger, who aimed to make the anthem more gender neutral. Belanger’s bill was introduced in 2016 and approved later that year with Liberal and NDP support weeks prior to the MP’s death following a diagnosis of amyotrophic lateral sclerosis, commonly called Lou Gehrig’s disease.Crombie said she stood behind the proposed change to the anthem lyrics and the motion was one of several initiatives the city was undertaking as part of reconciliation work.“The proposed change doesn’t change our country’s dark history, but has a meaningful impact in advancing reconciliation by promoting an honest understanding of our nation in the past,” she said. “And I felt that being truthful and honest about our past will make us stronger and more honourable as a nation.”“I think this needs a lot more study,” said Ward 5 Coun. Carolyn Parrish. “I don’t want a lot of time spent or a lot of money spent because it’s a federal issue.”Parrish also questioned whether using the term Indigenous was more appropriate than native in any proposed anthem changes and said she’s only received negative feedback about the motion.The deferral vote passed with 10 in favour and one against, with Ward 11 Coun. Brad Butt being the only council member opposing it.In an interview with the Mississauga News, Butt said he voted against deferring because “quite frankly, I don’t want this motion coming back. If people want the words of the national anthem changed, call your MP,” he said, adding he doesn’t believe municipal council should get involved.A city spokesperson said in an email there was no date set for the anthem changing motion to return to council.Top stories delivered to your inbox."
  },
  {
    "body": "‘My power is through my words': Guelph Indigenous and disability advocate Mike (O’dah ziibing) Ashkewe",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/1/fe/1fe0e11c-02ca-5c3c-9a69-788970a3df6c/646d4396bef98.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/my-power-is-through-my-words-guelph-indigenous-and-disability-advocate-mike-o-dah-ziibing/article_fcef4629-b738-5592-a07e-13c11c1c4e10.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.Mike (O’dah ziibing) Ashkewe is a community activist in the city of Guelph and a freelance writer for the Guelph Mercury Tribune. He is a Sixties Scoop survivor who has written about discovering his sense of belonging.He is known as an independent media producer, writer and broadcaster and the executive producer of This Week in Geek.WHAT DO YOU DO? WHAT IS YOUR CALLING?“Most of the stuff I do here in Guelph, and provincially and federally, is in trying to get people to talk, to create conversations, to create bridges between communities. Not just to get Indigenous groups to talk between each other, but to gather other community members and build something for the future,” Ashkewe said. “You see so many different perspectives and it’s wanting to uplift those voices so they can be heard by those in power to hopefully make those important changes.”WHY IS THAT YOUR PASSION?“One of the big things I believe is there has to be a melding of the old ways and the new ways,” said Ashkewe. I found out as part of my clan, which is Clan Bear, …, that it includes diplomats and politicians — that also means facilitators who are interested in creating conversations.”“I was gifted recently a snapping turtle necklace, and I was told I was powerful in snapping turtle medicine. My power is through my words,” he said. “I figure, the more people I can get talking, that creates something better than one voice.”WHAT DRIVES YOU?“It’s the fact that I never know what tomorrow is going to bring,” said Ashkewe. “For me, it’s always, what’s the next adventure?”WHAT IS THE BEST ADVICE YOU HAVE RECEIVED?“Be teachable,” he said. “Always be learning, always be listening, be willing to be wrong, be willing to be vulnerable.”IF A NON-INDIGENOUS CANADIAN COULD LEARN ABOUT ONE PART OF INDIGENOUS HISTORY THIS MONTH, WHAT SHOULD THAT BE?“From my own personal experience, I would say the Sixties Scoop,\" said Ashkewe. \"That’s where our language and culture was forcibly taken from us, because we were taken from our families.”Top stories delivered to your inbox."
  },
  {
    "body": "Paul Arculus to lead 'health-care heritage' tour of Scugog cemetery",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/b/d1/bd104c36-d307-532a-b372-ee600ef0eb44/647619cb4e159.image.jpg?resize=200%2C150",
    "url": "https://www.durhamregion.com/news/paul-arculus-to-lead-health-care-heritage-tour-of-scugog-cemetery/article_c42aaa1e-c4c8-56d5-8c6e-1aee378b1ba5.html",
    "description": "The Lake Scugog Historical Society will look at the community’s health-care heritage during a cemetery stroll on June 11.Scugog historian and author Paul Arculus will lead a Our Health Care Heritage tour of the Pine Grove Cemetery in Prince Albert, showcasing the historical health-care providers who rest there.Participants are asked to park at the Prince Albert Hall, 19 Jeffery St., and enter the cemetery through the Barber Street entrance.The tour will start at 2 p.m. and last about an hour; it'll be held rain or shine. Refreshments will follow at the Prince Albert Hall.The walk is free, but donations to the historical society will be accepted.For more information, visit www.lakescugoghistoricalsociety.com.\nTop stories delivered to your inbox."
  },
  {
    "body": "Upcoming working dog event in Goodwood free for guests",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/d/a0/da0cd1b5-f3ce-5777-bf96-9ffe4d0b27e2/647783eac4d69.image.jpg?resize=200%2C267",
    "url": "https://www.durhamregion.com/things-to-do/upcoming-working-dog-event-in-goodwood-free-for-guests/article_317d344e-47b8-5d60-994e-748e7f2d2ad3.html",
    "description": "Ever want to see a working dog in action? An upcoming event is your ticket.A local working dog club is hosting the Ontario Regional IGP Championship and Seiger Show, and the public is invited to attend for free. A food truck will be on-site for hungry visitors.IGP (Internationale Gebrauchshunde Prüfungsordnung) is a worldwide dog sport that demonstrates a dog’s working potential, and shows the teamwork between a dog and its handler.The event runs from Thursday, June 8 to Saturday, June 10, and the show and breed surveys are scheduled for Sunday, June 11. Saturday will showcase dogs participating in the working trial, while Sunday is specifically a conformation show for German shepherds, during which dogs are judged based on their meeting the breed standard for a German shepherd.The best time for spectators to attend is beginning at 9 a.m., on the Saturday and Sunday. The event will wrap up at around 5 p.m. those days.Synergy Working Dog Club, located at 565 Uxbridge-Pickering Townline in Goodwood, applies tested methods of behavioural science in order to understand and communicate with dogs, in a supportive environment.This event is also referred to as the Ontario Schutzhund Regionals.WHAT IS A SCHUTZHUND?Schutzhund means “protection dog” in German, and is a sport that demonstrates the dog’s ability to work in harmony with their handler, and to demonstrate their courage and obedience.A working trial will measure the dog’s mental stability, endurance, ability to scent and willingness essential to work, its courage and overall trainability. It’s a 100-year-old sport that started in Europe and has gained incredible momentum in Canada.World-renowned judges will be scoring their work.Visit synergyworkingdogclub.com for more information.Top stories delivered to your inbox."
  },
  {
    "body": "One man dead following single-vehicle collision in Brock Township",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/8/d2/8d249b6d-6c9b-5896-a4f9-362047d95901/647b5a2e382d4.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/one-man-dead-following-single-vehicle-collision-in-brock-township/article_2c3caf1f-06cd-544d-b88d-01e9ce103784.html",
    "description": "A 62-year-old man from Beaverton is dead after his vehicle left the road Friday, June 2.According to Durham police, at around 5:45 p.m. Friday, officers were called to a single-vehicle collision on Lakeridge Road near Beach Road in Brock Township. Police report that a black 2003 Ford F150 pickup was reportedly driven off the road and into a ditch. The driver, and only occupant in the vehicle, was taken to hospital where he was later pronounced deceased.Members of the DRPS Traffic Services Branch - Collision Investigation Unit, attended the scene to conduct an investigation. The road was closed for several hours while evidence was collected.Anyone with information about this incident or witnessed this collision is asked to contact D/Cst Rayne of the Collision Investigation Unit at 905-579-1520 ext. 5256.Top stories delivered to your inbox."
  },
  {
    "body": "'Honour, recognize and respect': Durham observes National Indigenous History Month",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/3/9d/39d07c0c-8604-5a93-acac-2f2689c01839/6478b6b7e3040.image.jpg?resize=200%2C150",
    "url": "https://www.durhamregion.com/life/honour-recognize-and-respect-durham-observes-national-indigenous-history-month/article_96649e36-aee1-5068-abb7-c5df99de2bd2.html",
    "description": "Durham Region wants residents to know National Indigenous History Month is a time to think about and honour the achievements of First Nations, Inuit and Métis people.The month runs through June and is an opportunity to reflect on the accomplishments on Indigenous Peoples.“We are extremely grateful for the opportunity to operate on the traditional and treaty territories of the Nations covered under the Williams Treaties, including the Mississaugas of Scugog Island First Nation, Alderville First Nation, Hiawatha First Nation, Curve Lake First Nation, and the Chippewa Nations of Georgina Island, Beausoleil and Rama,” John Henry, Durham Region chair, said in a statement.“We honour, recognize and respect these Nations and Indigenous Peoples as the traditional stewards of the lands and waters on which we have the privilege to operate,” Henry added.Henry noted the region is committed to advancing truth and reconciliation and is working toward building and renewing relationships to address past inequities, to continue the learning journey and create spaces for healing.The medicine wheel flag will fly at the regional headquarters during the month.“This month and beyond, I encourage residents to seek out knowledge about the rich and diverse histories, heritage and culture of First Nations, Inuit and Métis Peoples,” Henry said.To learn more, visit the Indigenous support and resources page on durham.ca.Top stories delivered to your inbox."
  },
  {
    "body": "'My heart will always be with my community': Kelly LaRocca is now in her fifth term as chief of the Mississaugas of Scugog Island First Nation",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/1/a3/1a3d3841-33fb-5b7a-9a2e-23dbc58e3da3/64678eb8ab489.image.jpg?resize=200%2C120",
    "url": "https://www.durhamregion.com/news/my-heart-will-always-be-with-my-community-kelly-larocca-is-now-in-her-fifth/article_0fe77139-f868-5a97-a20c-61cedbaceeaa.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.As Kelly LaRocca worked toward completing her law degree, she looked forward to returning home to serve her community — the Mississaugas of Scugog Island First Nation.To her surprise, however, LaRocca’s uncle, Gary Edgar, himself a former chief of the MSIFN, advised her that the timing wasn’t right just yet.“You need to gain a broader frame of reference and experience in the mainstream community and learn about how things work outside of the first nation. Flex your academic muscles and put them to good use in the mainstream so that you can build your skills and have that experience come and benefit your community later,” recalled LaRocca of that conversation with Edgar. “I think that was the best bit of advice he could have given me. To this day, I’m very thankful for it.”Going on to become an insurance defence and class-action litigation lawyer, LaRocca entered politics in 2008 as a Scugog Island First Nation councillor before being elected as chief in 2013. She is now in her fifth term as chief, serving as an advocate for her community, spokesperson, entrepreneur to spur economic growth for her First Nation and cultural leader.“My heart will always be with my community, my ancestral connections are part of this community, and so that plays a significant role in how passionate I am about Indigenous issues and about Scugog First Nation,” she said of serving the MSIFN.“I lost my mum in 2003 and I wanted to do my best to honour her legacy, so that’s a big part of why I do what I do. But also, I just feel a connection to this geographic place and space and now I have children in the community who will be the beneficiaries of all the hard work of previous leadership and community decisions,” continued LaRocca. “I want to make a better place for not only my children, but the children at large.”The Indigenous population at large represents a “celebration of human resiliency,” added the MSIFN chief.“I’m very proud to be part of the Indigenous community because they’ve survived against all odds and, it’s more than just survival, it’s about picking up culture, being proud of it and ... applying culture as healing and I think it’s showing in the successes of our communities and it’s showing in the promise and hope of our youth,” said LaRocca.Top stories delivered to your inbox."
  },
  {
    "body": "‘The proof is in the pudding’: Clarington seeks investigation of Newtonville Road rebuild",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/8/d4/8d4f6cf9-7928-5fdc-a952-f8b194a5f754/647a01ec12f46.image.jpg?resize=200%2C113",
    "url": "https://www.durhamregion.com/news/the-proof-is-in-the-pudding-clarington-seeks-investigation-of-newtonville-road-rebuild/article_20c14dc8-08f3-5a1c-bf80-1611a4dd4f95.html",
    "description": "The Municipality of Clarington is requesting the region investigate an award-winning reconstruction project on Newtonville Road.The Newtonville Road Rehabilitation Project, which was completed in 2022 using recycled blue box materials and other materials to reconstruct the road, was recently awarded the Project of the Year award from the Ontario Public Works Association.“The Newtonville Road Rehabilitation Project demonstrates Durham Region’s commitment to innovation by looking at ways to reuse recycled municipal material, while also improving our environmental footprint,” said Ramesh Jagannathan, director of transportation and field services for the Region of Durham, of the project.“This project is the first of its kind undertaken by the Regional Municipality of Durham. It was carried out by studying the findings from over 60 years of experience with nearly 100 pavement trial sections around Canada. This recognition from the OPWA promotes Durham Region as a leader in this industry.”The project had received criticism from local residents concerned about the nature of materials used in the reconstruction and the potential environmental impacts of using them in a paving project. At a council meeting on May 29, Coun. Margaret Zwart introduced a motion requesting the region conduct soil and water testing around the project site to determine if any leaching from the materials has occurred.“This is an award-winning project apparently, but the proof is in the pudding, and I’d like to know there are no toxins leaching from the recycled materials in the road before we call it a success,” she said.The first phase of the Newtonville Road project was completed using traditional road rehabilitation methods and materials. For Phase 2, an adjacent section of the same road was completed using about 400 tonnes of recycled glass from the blue box collections in granular base, while the asphalt included about six tonnes of recycled plastics from blue box collections and 4.5 tonnes of polyethylene teraphalate (PET) fibres made from recycled plastics.“The future of Durham Region’s waste management includes looking at using wastes as a resource to improve the circularity of our economy,” said Andrew Evans, director of waste management for the Region of Durham. “By instruction of Durham regional council, staff found a way to incorporate materials from blue box collections into road construction. Receiving the Project of the Year award from OPWA shows the impact that this type of project can have on the future of road construction while finding a new use for recycled materials.”Clarington councillors supported Zwart’s motion, with Mayor Adrian Foster noting the outcome of the testing could further cement the success of the project.“If in fact the tests are done and this works, what a great way of possibly reusing material that should be reused,” he said. “Of course, there are the issues of durability of the road and environmental impacts, so there are a couple different dynamics here, but I think it should be fairly simple to determine if this is safe. And if it is, boy, do we really have some good news here.”Council’s request for the region to hire a third-party consultant to undertake soil and water testing will be brought before regional council for discussion at a future meeting.Top stories delivered to your inbox."
  },
  {
    "body": "Facebook and Instagram are about to start blocking news for random Canadians. Here’s what it will look like if you’re targeted",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/5/1e/51eb3ce1-8133-5d34-a64b-ed66fd7f7b39/647a47ba939f6.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/facebook-and-instagram-are-about-to-start-blocking-news-for-random-canadians-here-s-what/article_7352032f-1f4d-5c5a-b1e9-9793cb9faebf.html",
    "description": "OTTAWA—Meta, the tech giant that owns Facebook and Instagram, will soon start blocking the sharing and posting of news content for some Canadians on those platforms as part of a testing strategy that could become permanent — and rolled out nationwide — if Ottawa’s online news bill passes unchanged.In the coming days, Meta will introduce the tests in preparation for the potential passage of Bill C-18, or the Online News Act, which it opposes.The bill would force digital giants like Meta and Google to enter into deals with Canadian media publishers for directing their users to and sharing online news. The federal government has framed the bill as an attempt to create a more balanced relationship between news outlets and the digital platforms, which Ottawa says unfairly dominate the digital advertising market. Torstar, which owns the Toronto Star, supports the bill, and currently has deals with both platforms for news sharing.Meta’s move follows a similar tactic employed by Google earlier this year, which saw the global search giant quietly launch a test that filtered out Canadian and international news content for some of its users in Canada.For “several weeks” — Meta won’t reveal the precise duration of the test — a “small percentage” of Canadian users will be blocked from viewing, sharing or posting certain news content on Facebook and Instagram.“When a big tech company, whatever the size is, the amount of money and the powerful lawyers they have, they come here and they tell us, if you don’t do this or that, then I’m pulling the plug — that’s a threat and that is unacceptable,” Heritage Minister Pablo Rodriguez said in a statement in response to the news.“I never did anything because I was afraid of a threat, and I will never do it.”Here’s what else Canadians can expect, and why Meta is taking the controversial step.What will this look like for me?Meta says one to five per cent of Canadian Facebook and Instagram users will be chosen at random and enrolled in the tests. The company won’t disclose the total number of Canadians set to be affected. It says 24 million people in Canada use its apps — which include Facebook, Instagram and WhatsApp — but would not break down those numbers.If someone is selected, they won’t be told in advance; they’ll only find out when they try to share news content on their profile and receive a notification informing them they cannot do so.Affected users also won’t be barred from sharing every news story they want to post. Instead, they’ll be blocked from sharing content from specific news publishers.Meta told the Star that selected users on the platforms could experience the news ban differently, and that the number of people affected could fluctuate over the course of the test.What does this mean for news outlets?News accounts affected by the test will also be chosen at random, but they’ll be plucked from a list of outlets that match the criteria outlined in the bill over what constitutes an “eligible news business.”Those are outlets that have been deemed a “qualified Canadian journalism organization” as defined under the Income Tax Act and that produce “news content of public interest.” Among other criteria, eligible outlets should employ two or more journalists within Canada and should operate in Canada.Rachel Curran, Meta Canada’s head of public policy, says that means international news publishers that partially operate in Canada could also be included the test.“The New York Times or the Wall Street Journal or the BBC or any of those outlets that have a presence in Canada … their content will also not be viewable or shareable by users in Canada,” she told the Star.When the test commences, the profiles for news pages in Canada won’t be pulled down, and publishers won’t be restricted from posting content. The company will instead restrict “the viewability and shareability” of news content on those pages for any users targeted in the test.Tell me more about this bill — and why Meta is pushing backA key argument underpinning the government’s motivation for introducing C-18 last spring is that it says the web giants are “gatekeepers” that “derive significant financial benefit for their operations in Canada.”Ottawa has also been critical of Meta and Google’s attempts to restrict news content online in response to similar legislative moves in other countries. Canada’s bill is based on Australia’s News Media Bargaining Code, which saw Facebook pull news from its platform in that country for seven days. MPs and senators, meanwhile, have questioned whether removing trusted news sources from online platforms would allow misinformation to spread unchecked.Meta and Google have argued for months that news content only accounts for a small percentage of the queries — and revenue generated — on their platforms.“News content represents less than three per cent of what’s in-feed,” Curran said.Meta says that rather than siphoning advertising dollars away from news publishers, it sends more than a billion clicks to their sites in a year, representing hundreds of millions in revenue.The company has put forward a series of amendments it wants to see backed by senators and MPs as the bill enters what could be its final weeks of study. Some of those changes include altering definitions of what constitutes news content and how it is made available online.“We don’t want to pre-empt the Senate’s work. We’re appreciative, very appreciative of the fact that I think they’re taking a close look at amendments and really doing a policy dive into the bill,” Curran said.“This is really about preparing for the possibility of Bill C-18 passing substantively as drafted, and in order to prepare properly for that passage, we have to start testing now.”\nTop stories delivered to your inbox."
  },
  {
    "body": "'IN A RUSH': Porsche and BMW drivers in Milton neighbourhoods accused of stunt driving and residents are not happy",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/0/39/039d8f08-c9e9-5a6f-b421-99456301b986/647c8b1c17035.image.jpg?resize=200%2C99",
    "url": "https://www.insidehalton.com/news/crime/in-a-rush-porsche-and-bmw-drivers-in-milton-neighbourhoods-accused-of-stunt-driving-and/article_0fa4b7a4-3219-5949-b418-a84df52fe1dd.html",
    "description": "Halton Regional Police have had a busy few days on Milton roads laying speeding and stunt driving charges.Police say a Porsche Cayenne in a Milton neighbourhood Saturday (June 3) was going at least 40 km/h over the posted speed limit and, as a result, the driver will have the vehicle impounded for 14 days and has been issued a 30-day drivers' licence suspension due to the stunt driving charge.The same applies to a BMW on Guelph Line in Milton Friday (June 3), according to police, who allege they were going 135 km/h in a posted 80 km/h zone.\"This driver was certainly in a rush as it passed (police) and another vehicle in a 60 km/h zone. That vehicle took off in the 80 km/h zone getting up to a speed of 135 km/h on Guelph Line,\" Halton police said in a tweet. \"Driver had no idea they passed an officer in the process. Charges laid, vehicle impounded.\"The incidents triggered some passionate responses on social media.\"Would be interesting to know if these speed demons live in Halton or just using the back roads to get to their hometown,\" Peter Osgood tweeted.\"Shocking,\" Colin Shanks added.Top stories delivered to your inbox."
  },
  {
    "body": "‘My power is through my words': Guelph Indigenous and disability advocate Mike (O’dah ziibing) Ashkewe",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/2/d7/2d77e680-331c-5e41-8081-dc915bc15509/646d4396babf8.image.jpg?resize=200%2C133",
    "url": "https://www.insidehalton.com/news/my-power-is-through-my-words-guelph-indigenous-and-disability-advocate-mike-o-dah-ziibing/article_0dfe3d67-f669-586e-8356-09d59d2387af.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.Mike (O’dah ziibing) Ashkewe is a community activist in the city of Guelph and a freelance writer for the Guelph Mercury Tribune. He is a Sixties Scoop survivor who has written about discovering his sense of belonging.He is known as an independent media producer, writer and broadcaster and the executive producer of This Week in Geek.WHAT DO YOU DO? WHAT IS YOUR CALLING?“Most of the stuff I do here in Guelph, and provincially and federally, is in trying to get people to talk, to create conversations, to create bridges between communities. Not just to get Indigenous groups to talk between each other, but to gather other community members and build something for the future,” Ashkewe said. “You see so many different perspectives and it’s wanting to uplift those voices so they can be heard by those in power to hopefully make those important changes.”WHY IS THAT YOUR PASSION?“One of the big things I believe is there has to be a melding of the old ways and the new ways,” said Ashkewe. I found out as part of my clan, which is Clan Bear, …, that it includes diplomats and politicians — that also means facilitators who are interested in creating conversations.”“I was gifted recently a snapping turtle necklace, and I was told I was powerful in snapping turtle medicine. My power is through my words,” he said. “I figure, the more people I can get talking, that creates something better than one voice.”WHAT DRIVES YOU?“It’s the fact that I never know what tomorrow is going to bring,” said Ashkewe. “For me, it’s always, what’s the next adventure?”WHAT IS THE BEST ADVICE YOU HAVE RECEIVED?“Be teachable,” he said. “Always be learning, always be listening, be willing to be wrong, be willing to be vulnerable.”IF A NON-INDIGENOUS CANADIAN COULD LEARN ABOUT ONE PART OF INDIGENOUS HISTORY THIS MONTH, WHAT SHOULD THAT BE?“From my own personal experience, I would say the Sixties Scoop,\" said Ashkewe. \"That’s where our language and culture was forcibly taken from us, because we were taken from our families.”Top stories delivered to your inbox."
  },
  {
    "body": "Oakville boy, 2, pulled from backyard pool in near drowning",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/5/ee/5ee02f8e-5eec-5cb0-b8e8-f28eb0eb1e42/647ba965d8431.image.jpg?resize=200%2C117",
    "url": "https://www.insidehalton.com/news/oakville-boy-2-pulled-from-backyard-pool-in-near-drowning/article_0a68fe96-9a03-548b-b65c-566de73041e3.html",
    "description": "A two-year-old boy is in hospital after falling into a backyard pool Saturday (June 3).The incident occurred around 9:30 a.m. on Ashbury Road, in the area of Dorval Drive and Speers Road.Reports indicate the child was pulled from the pool and a family member performed CPR before Oakville firefighters, Halton police and Halton Region paramedics arrived.The child was rushed to a hospital, but was conscious and alert, according to reports.Halton police are investigating.This incident comes just one week after a three-year-old boy drowned in a backyard pool in Oakville, just a couple kilometres from where this latest incident occurred.Top stories delivered to your inbox."
  },
  {
    "body": "ICYMI: Top 5 stories of the week in Oakville, Burlington and Milton from InsideHalton.com",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/e/ce/eced9405-5290-5186-91c6-52eb54ac3a7e/6478c08bcdfed.image.jpg?resize=200%2C119",
    "url": "https://www.insidehalton.com/news/icymi-top-5-stories-of-the-week-in-oakville-burlington-and-milton-from-insidehalton-com/article_efec9eb8-7a11-5598-b07e-8b26534c8439.html",
    "description": "If you didn't have chance to catch up on all the latest headlines, here's a look back at what had people talking across Halton this week. To stay up to date with local headlines, sign up for our newsletter delivered to your inbox every day, seven days a week.1) Major recalls: https://www.insidehalton.com/news/warning-people-major-recalls-at-costco-longos-and-m-m-food-market-on-certain-burgers/article_e0e92aff-6b4b-5aee-9705-5f800813005f.html2) Missing Milton woman found safe: https://www.insidehalton.com/news/update-missing-milton-woman-39-has-been-found-safe/article_59c432b8-e7ea-56c9-b76e-9004d7226b49.html3) Well-known Oakville restaurant closes: https://www.insidehalton.com/news/great-sadness-well-known-oakville-restaurant-permanently-closing-and-customers-are-expressing-disappointment/article_794e1960-8fae-5299-8a9f-7a5b590ff77b.html4) Residents alarmed by Midtown Oakville plans: https://www.insidehalton.com/news/extreme-residents-alarmed-by-midtown-oakville-plans/article_d3ea472f-8234-5e86-9141-7a09645ba156.html5) 'Auto theft trend' in Oakville: https://www.insidehalton.com/news/crime/halton-police-identify-auto-theft-trend-in-oakville-neighbourhoods-and-have-new-warnings-for-residents/article_13e23732-a147-5127-a715-8bcde19b25c0.html\nTop stories delivered to your inbox."
  },
  {
    "body": "‘Guide our forestry practices’: Burlington updating Urban Forest Master Plan",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/3/2e/32ee512c-8b7e-58a1-99c9-cf929dbf9e92/647614a3b4a37.image.jpg?resize=200%2C130",
    "url": "https://www.insidehalton.com/news/guide-our-forestry-practices-burlington-updating-urban-forest-master-plan/article_619dc173-07c2-59f6-a175-8194127abc6c.html",
    "description": "The city is growing, and that means the plans that guide growth need to be updated.Burlington is updating the Urban Forest Master Plan (UFMP) and has now created a draft version of the proposal. Residents are invited to review the document and provide feedback into the draft at a June 7 public information session or through an online survey available until June 30.The UFMP will provide the strategic direction important to managing the urban forest in response to pressures and challenges related to urban development, climate change, extreme weather and invasive pests.Enrico Scalera, director of roads, parks and forestry, said he appreciates everyone who provided input to the UFMP.“This document will guide our forestry practices for many years, so it is important our priorities are reflected within the master plan,” said Scalera.To take part in the online survey, visit www.getinvolvedburlington.ca/ufmp.For the in-person information session, which will include presentations from city staff and forestry experts, the event will be held on June 7 from 7 p.m. to 8:30 p.m. at the Tansley Woods Recreation Centre at 1996 Itabashi Way. Residents can participate in the meeting online through www.getinvolvedburlington.ca/ufmp.A separate information session for industry professionals such as arborists, landscapers and developers is planned for June 9 by invitation only. If you would like to attend, please email city@burlington.ca.Once feedback is collected from residents and industry professionals, the UFMP will be finalized. The final master plan and report will be presented to Burlington City Council in late 2023.For more information on the city’s forestry plans, visit www.burlington.ca/forestry.Top stories delivered to your inbox."
  },
  {
    "body": "Halton Region donating 2 ambulances to St. John Ambulance",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/8/ef/8ef1835d-a6fd-5e91-8e6e-a4829777363f/647a279c4fe6d.image.jpg?resize=200%2C133",
    "url": "https://www.insidehalton.com/news/halton-region-donating-2-ambulances-to-st-john-ambulance/article_4ef8054e-c822-52ed-a952-ed75f778e425.html",
    "description": "Halton Region donated two decommissioned ambulances to St. John Ambulance Canada on May 24. The vehicles will be going to the Halton branch and used by volunteers to provide medical support for residents at community events.In a release, Halton Regional Chair Gary Carr said — on behalf of the region — that he is proud to donate the vehicles.“This donation, which is supporting their medical responder program, represents a partnership that has spanned over 20 years, to help provide first aid services to residents attending community events. I’d like to thank St. John Ambulance Canada staff and volunteers for their commitment to ensure the care and safety of those who need it,” Carr said.Greg Sage, chief/director of Halton Region Paramedic Services, said that the region is “grateful to have community partners like St. John Ambulance Canada who help provide essential first aid and medical assistance at community events across Halton.”St. John Ambulance Canada is an international humanitarian organization that provides community service, first aid and CPR training. Its members volunteer hundreds of hours at community events every year.Tim Bauer, executive director of St. John Ambulance Halton-Hamilton Region, said the organization’s mandate is “saving lives at home, work and play.”“Halton Region's generous donation of two vehicles in support of our program allows our volunteer teams to provide first aid coverage at hundreds of community events every year in Halton. Our sincerest thanks to the Halton Region for their continued support.”The vehicle donation coincided with Paramedic Services Week.Top stories delivered to your inbox."
  },
  {
    "body": "'Major issue': Overall house prices dip in Oakville and Burlington but sales and new listings way up, real estate report shows",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/9/15/9155d28f-3e62-59bd-9b61-8782cb2e0f1a/647b63cb45ee7.image.jpg?resize=200%2C125",
    "url": "https://www.insidehalton.com/news/major-issue-overall-house-prices-dip-in-oakville-and-burlington-but-sales-and-new-listings/article_41809f11-7585-598f-936d-74adb9287754.html",
    "description": "House prices overall dropped in Oakville and Burlington last month as sales and new listings are seeing significant increases.These are the latest findings from the Toronto Regional Real Estate Board (TRREB), which released its May report Friday (June 2) and it shows some interesting real estate trends in Oakville and Burlington compared to April numbers.Overall house prices saw a dip in both municipalities, with house prices in Oakville selling for an average of $1,554,259 last month, a two per cent dip from $1,580,110 in April.In Burlington, overall house prices also went down, with an average selling price of $1,115,294 in May compared to $1,149,169 in April. This represents a three per cent drop.When it comes to sales, there were 332 in Burlington last month, way up from 278 in April.The same trend exists in Oakville, with 327 sales in May compared to 296 in April.The GTA housing market continued to improve from a sales perspective in May, TRREB said in its report, but added \"unfortunately, the supply of homes for sale did not keep up with the demand for ownership housing.\"There was also a big jump in new real estate listings in both Oakville and Burlington, with Oakville seeing 565 new listings in May compared with 429 in April and Burlington seeing 437 new listings last month compared with 361 in April.Sales as a share of new listings were up dramatically compared to a year ago. TRREB says this is a clear signal that competition between buyers increased substantially compared to last year, resulting in the average selling price reaching almost $1.2 million last month.“Despite the fact that we have seen positive policy direction over the last couple of years, governments have been failing on the housing supply front for some time. Recent polling from Ipsos found that City of Toronto residents gave council a failing grade on housing affordability and pointed to a lack of supply as the major issue,\" said Toronto Regional Real Estate Board (TRREB) president Paul Baron. \"This issue is not unique to Toronto. It persists throughout the Greater Golden Horseshoe. If we don't quickly see housing supply catch up to population growth, the economic development of our region will be hampered as people and businesses look elsewhere to live and invest.”GTA realtors reported 9,012 sales through TRREB’s MLS System in May 2023 – a 24.7 per cent increase compared to May 2022. Conversely, new listings were down by 18.7 per cent over the same period, TRREB said.On a month-over-month seasonally adjusted basis, sales were up by 5.2 per cent compared to April 2023.“The demand for ownership housing has picked up markedly in recent months. Many homebuyers have recalibrated their housing needs in the face of higher borrowing costs and are moving back into the market. In addition, strong rent growth and record population growth on the back of immigration has also supported increased home sales. The supply of listings hasn't kept up with sales, so we have seen upward pressure on selling prices during the spring,” said TRREB chief market analyst Jason Mercer.Top stories delivered to your inbox."
  },
  {
    "body": "2 Burlington businesses take home $200,000 in prizes at small business contest",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/8/27/827465d3-46f3-531e-b8cf-364e9829d3d8/6478bd0773533.image.jpg?resize=200%2C129",
    "url": "https://www.insidehalton.com/news/2-burlington-businesses-take-home-200-000-in-prizes-at-small-business-contest/article_516e4666-8de4-5468-bdd1-87474334bd1f.html",
    "description": "Burlington organizations are once again proving they have what it takes on a big stage.Joe Apps Technology Support Inc. and Laila’s Cheesecake Co. were two of the winners at the 2023 FirstOntario 1Awards. The annual program, now in its 11th year, has local businesses present 15-minute pitches to the partners about the business, past success, present challenges and future aspirations.Winners received $25,000 in cash and $175,000 in professional, in-kind services.Joanne Battaglia, senior vice-president, marketing, communications and community partnerships at FirstOntario Credit Union, said they had a significant number of applicants for the prize this year.“We had a record-setting number of applications this year as the 1Awards program continues to grow and expand. We’re fortunate to be surrounded by business owners who are so passionate about what they do and how they can make an impact. Congratulations to all of the finalists,” said Battaglia.Joe Apps Technology Support Inc. is a Burlington-based company offering IT services including cybersecurity, compliance, and business process support for small businesses.Laila’s Cheesecake Co is a Burlington bakery specializing in unique and high quality cheesecake.FirstOntario is a full service co-operative financial institution, serving members for more than 80 years throughout the Golden Horseshoe, Niagara Region and Southwestern regions of Ontario.Top stories delivered to your inbox."
  },
  {
    "body": "Community group ACE hosts Markham forum on interpreting 2023 budgets of all levels of government",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/2/5c/25c10168-180c-54c0-a126-b53e94546143/647907913a37f.image.jpg?resize=200%2C150",
    "url": "https://www.yorkregion.com/news/community-group-ace-hosts-markham-forum-on-interpreting-2023-budgets-of-all-levels-of-government/article_52bbf532-c312-5c93-a300-be0a6bff79f0.html",
    "description": "Active Community Engagement (ACE) Ontario, a non-profit organization dedicated to promoting political participation and giving back to society, hosted an insightful panel discussion on interpreting 2023 government budgets.The event brought together renowned experts to shed light on the key highlights and implications of the annual budgets announced by all three levels of government.The forum was supported by community leaders such as Markham regional councillor Alan Ho, Ward 2 city councillor Ritch Lau and retired police officer Raymond Miu.The 2023 Budget Forum took place on May 21 at Pacific Mall in Markham. The event aimed at fostering a deeper understanding of the budgetary decisions made by the governments, with a specific focus on the macroeconomy, housing affordability, real estate market and other significant aspects.ACE had invited the following guests to share their expertise and insights:• Terence Yuen — senior economist: As a respected economist, Yuen offered an expert analysis of the budget's macroeconomic implications, policy priorities, and their potential effects on businesses and the overall economy.• Alice Cheung — senior real estate expert: With years of experience in the real estate industry, Cheung provided valuable insights into the potential impact of the budget on the property market, investment opportunities, and related sectors.The panel discussion engaged the audience in an informative and interactive conversation, providing them with a comprehensive understanding of the 2023 budgets and their implications for various sectors. Attendees had the opportunity to ask questions and gain valuable insights directly from the panellists.“By bringing together experts from different fields, we hoped to foster informed discussions and empower individuals to actively participate in shaping the future of our society,” said Robin Choy, president of ACE.Through various initiatives and events, ACE aims to empower individuals to actively contribute to the betterment of society. For more information about ACE and its initiatives, visit aceontario.org.Top stories delivered to your inbox."
  },
  {
    "body": "Shoppers Drug Mart Run for Women inspires record-breaking community support to benefit mental health",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/d/ad/dadd3f3c-c361-54b7-8a7e-e916fda93cf3/647922c2a1b20.image.jpg?resize=200%2C150",
    "url": "https://www.yorkregion.com/news/shoppers-drug-mart-run-for-women-inspires-record-breaking-community-support-to-benefit-mental-health/article_58dbf525-7bef-594f-84a4-dc164dd58ad6.html",
    "description": "This year’s Shoppers Drug Mart Run for Women in Markham was an overwhelming success, with nearly 1,700 attendees and a record-breaking amount donated to Markham Stouffville Hospital (MSH).Community supporters participated in the 11th annual Shoppers Drug Mart Run for Women in support of Oak Valley Health’s MSH on May 28.Shoppers Foundation for Women’s Health has once again partnered with MSH Foundation and has raised a record-breaking $300,000 that will be used to enable a variety of women’s wellness programs for the Gulshan and Pyarali G. Nanji Mental Health Services at MSH.Grateful patient Sandra Rodrigues-Turner took to the stage to talk about her own experiences with mental health and why supporting local mental health programs is so important.“I had feelings of not wanting to live anymore. I couldn’t breathe, I couldn’t parent, I couldn’t get out of bed. I thought I would actually hurt myself and it’s something that I’ve never experienced before. The depression just got so deep that I couldn’t function,” shared Rodrigues-Turner. “The services and care provided at Markham Stouffville Hospital were integral in my journey to recovery. I got my life back.”The support from the Run for Women has addressed the unique obstacles that women in our community face and enabled the hospital’s women’s wellness program to support them on their paths to mental health wellness.“Every year, the need for mental health services is growing,” said Dr. Rus Sethna, chief of psychiatry at Oak Valley Health. “The Shoppers Drug Mart Run for Women and all who make this event possible help our organization deliver and expand programs that provide women with the unique support they need.”Over the past seven years, the Shoppers Drug Mart Run for Women has contributed over $1 million to benefit women’s mental health care at MSH. This fundraising is necessary, as the government can’t fund all of the hospital’s top priority needs.“Generous support is essential for Markham Stouffville Hospital to be able to remain on the cutting-edge of patient care,” said Suzette Strong, CEO at MSH Foundation. “Every dollar raised by participants supports mothers, daughters and friends in our community in taking the next step to recovery. We are so grateful for the partnership with Shoppers Drug Mart for making this possible.”Top stories delivered to your inbox."
  },
  {
    "body": "'Mount Albert to Hollywood': 20-year-old actor gets set to star in Disney, Netflix productions",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/6/2b/62b49745-7f80-5964-98cf-a388e1cfe863/646fd6c40d31b.image.jpg?crop=692%2C519%2C0%2C113&resize=200%2C150&order=crop%2Cresize",
    "url": "https://www.yorkregion.com/news/mount-albert-to-hollywood-20-year-old-actor-gets-set-to-star-in-disney-netflix/article_c88c977a-5738-5338-9346-fb50ded207ce.html",
    "description": "Chances are if you have lived in Mount Albert for any length of time you have seem Dorian Giordano riding his BMX bicycle. But that was a few years ago. The boy with a BMX ramp in his backyard is now a 20-year-old with an acting career that is taking off.“I started acting in 2016 doing BMX in a Nerf commercial,” he said. Seven years later, Giordano is about to be featured in a Disney Plus movie titled “World’s Best,” which is being released June 23. The new movie features a 12 year-old mathematics genius who discovers his father was a famous rapper and sets out to become a rap superstar. Giordano said he plays the 16 year-old cool kid in the movie. “I’m beat boxing in it,” he laughed.It's not the only big production the Mount Albert native has in the works. Giordano will also be cast in a big Netflix production coming out next year, he’s just not allowed to say what it is yet.Later this year, Giordano will also be in the Eli Roth slasher film “Thanksgiving,” which is being released in November. “Eli Roth is my all-time favourite director,” he said. Giordano starred in Eli Roth’s “Be Mine: A VR Valentine’s Slasher,” which was released earlier this year. He said Roth wrote his character into the Thanksgiving script.It’s all been a bit of whirlwind for Giordano whose acting career has really taken off in the last couple of years. His mom said he wasn’t supposed to be an actor and had a scholarship for engineering at McMaster University but Giordano said that life is on hold for the moment. “This is more fun,” he said. “I have so much energy. I get to experience adventures first hand.”Working and spending time with so many different people on various sets across the country has been the experience of a lifetime, Giordano said. “It’s been refreshing and humbling. We’re just normal people at the end of the day,” he said.For the next chapter in his acting journey, Giordano is planning to move to Los Angeles on 21st birthday.“I’m going to go from Mount Albert to Hollywood, I guess,” he said.He moved to Mount Albert when he was 10 years old and said he will probably miss portions of the small-town vibes. He still remembers the summer the skate park was built. “I was the backflip kid. I was just there doing backflips,” he said.Top stories delivered to your inbox."
  },
  {
    "body": "Plays from around the world will hit stage for Newmarket International Festival of One Act Plays Sept. 7 to 10",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/0/dd/0dd76fc1-dd5e-5f0b-b372-f11ed2b8bd0a/647a205b2c154.image.jpg?resize=200%2C229",
    "url": "https://www.yorkregion.com/news/plays-from-around-the-world-will-hit-stage-for-newmarket-international-festival-of-one-act/article_79490986-b421-5daa-8643-8b7454848dae.html",
    "description": "After receiving a record number of entries, the Very Useful Theatre Company has announced the lineup for this year’s Newmarket International Festival of One Act Plays.The reading committee, led by chair Bruce Williamson, a two-time festival best director award winner, spent several months combing through entries from around the world before deciding on the seven finalists, the company said in a statement.Here’s the lineup:• One Night Stan — a comedy by Adam Szudrich, of Sydney, AustraliaThree women recount their dates with Stan, simultaneously in rat-a-tat barrage of lust, self-doubt and questionable dance moves. A comedy about seeing the same things through different eyes.• That Thing With Feathers — a comedy by Steven Doloff of New York.A young woman's trials and tribulations encountered while submitting work to a one act play festival.• Shapes & Stanzas — A “Geometrilogy” by Ken Preuss of Oviedo, Florida.Follows a friendship between childhood sweethearts, often from afar, spanning 60 years. Will they or won't they?• What Do They Want? A Dramedy by Cary Pepper, of San FranciscoOn the sixth -floor rooftop terrace of a library, Burt encounters Gary, who’s muttering “Who are they? Why are they there? What do they want?” as he stares down at the street below. It doesn’t take Burt long to conclude that Gary is thinking of jumping, and he does his best to stop him. Or is something entirely different going on here? And if it is, what will Burt do about that?• I Miss You Already — A romance by Rose Scollard, of CalgaryDuring a health tragedy may not be the best time to break up. Or is it?• Get it off yer chest — A comedy by Jordana Belaiche, of London, EnglandA sleep paralysis demon comes to visit a young lady and does not get the reaction it expects. What then is a demon to do?• Provenance — a comedy by Ian Patrick Williams, of Studio City, CaliforniaA near-homicidal art collector confronts the forger whose painting he bought at auction.The festival will run Sept. 7 to 10 at the Newmarket Old Town Hall 460 Botsford St.Tickets are available at Newtix.ca or by texting 289-221-0928.For more information, visit www.oneactplayfestival.com.Meanwhile, the company and festival, under the direction of V.U.T.C. Young Company artistic director, Kira Rosenbloom, is offering free youth workshops for acting, playwrighting and directing.Workshops are for ages five to 24 and spaces are limited.“We also plan to add some musical elements to the plays created. Not really musicals, per se, but we want to have some more musical elements included,” Rosenbloom said.This year, the workshops include an introduction to deaf culture and deaf theatre lead by deaf actor J.P. Armani.On June 17, Armani will talk about deaf culture, deaf arts and sharing his experiences acting in Toronto's Sound Off Theatre Festival and at Mayfest. An interpreter will be provided for artists to ask questions and lunch will be provided.The workshops began May 27 and run to June 17.For more information and to sign up, visit forms.gle/he7E1ZZwodBEnm5m7Top stories delivered to your inbox."
  },
  {
    "body": "‘Home. Place. Belonging’: Virtual exhibit explores history of Chinese immigration to York Region",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/d/53/d531f770-823f-5452-9983-5aea015cdeaf/64779452c76b4.image.jpg?resize=200%2C150",
    "url": "https://www.yorkregion.com/things-to-do/home-place-belonging-virtual-exhibit-explores-history-of-chinese-immigration-to-york-region/article_e034dded-a2dc-5e88-a252-223582de9dbc.html",
    "description": "When Dr. Ken Ng, a community advocate and medical doctor in Markham, was born in Hong Kong in 1953, his father was living in Canada. Ng didn’t have the opportunity to meet his father until he first came to Canada in 1965.“The Chinese Exclusion Act was still in place at that time,” said Ng. “It was difficult for Chinese to immigrate to Canada. A lot of people have to pay taxes to get to Canada.”The story of the Ng family is knitted into a new virtual exhibition that marks the 100th anniversary of the Chinese Exclusion Act. The exhibition, titled “Standing in the Doorway: Lived Histories & Experiences of the Chinese Community,” is available on the York Region District School Board Museum and Archives website.From the gold rush to the Canadian Pacific Railway, from the Chinese head tax to anti-Asian discrimination, from dragon boat racing to Lunar New Year, the exhibit highlights the history of Chinese immigration to York Region, details Chinese culture while featuring artifacts, photographs and stories from the community.The exhibition has been developed in collaboration with community partners, students from the University of Toronto's museum studies program, and the Markham Museum. An in-person and travelling exhibition will open at the Markham Museum in September 2023.“As a school board, we want to ensure our students and families see themselves, their identities and cultures, reflected in their classrooms,” said Rebekah Mitchell, curator at YRDSB Museum and Archives. “We hope that educators, families and community members can use this virtual exhibit to learn more about the rich Chinese culture and history here in York Region and to spark conversations about their own identities.”“We want to tell the story of resilience and perseverance of an important community in Markham and York Region,” said Janet Reid, curator at Markham Museum. “This community-driven exhibit will celebrate our Chinese residents, and also engage and educate the wider community through a multi-part virtual and touring exhibition program.”Students and staff at several different YRDSB schools are also involved in the project, producing a variety of artistic pieces that reflect the resilience and perseverance of the residents of Chinese descent.YRDSB students and educators at Nokiidaa Public School, and Bur Oak, Unionville, Markham District, Markville and Pierre Elliott Trudeau high schools have provided important feedback, perspective, input and personal expression into the creation of this exhibition.In addition to the community oral histories that will be featured in the exhibition, educational kits will be shared with educators in the fall. Students and staff at Nokiidaa helped test and frame the educational kits that will accompany the travelling exhibition.“I like how we’re bringing awareness to the community about Chinese people,” said Serena, a Grade 7 student at Nokiidaa. “It was quite frustrating for me to learn about how there was a Chinese Exclusion Act in Canada, because you know how sometimes you think Canada is a wonderful place, none of this could happen, but the Chinese Exclusion Act happened and I’m still seeing some discrimination (against) Chinese people. I think this is a really good idea to appreciate Chinese culture.”“I wish that people would learn more about our culture since we showed many things like arts, games, toys and tools, so with all of that information, since they’ll get to know more about our culture, it will break culture gaps,” said Edith, a Grade 7 student at Nokiidaa.To learn more about the exhibition, and the significance of the Chinese Exclusion Act, listen to the Tune In YRDSB podcast episode featuring students and teachers, and Nancy Siew, community volunteer.“My blood is still Chinese, but my heart is Canadian,” said Siew, founding president of Asian Heritage Month Society. “You make Canada your new home, and you really should not treat this as a second country, but your real country that you should serve, love, and give back to.”\"Markham is my home. York Region is my home,\" said Ng.STORY BEHIND THE STORY: York Region reflects the heritage, history, and identity of its residents, including its community of Chinese diaspora. We felt that it’s important to headline an exhibit that highlights the history of Chinese immigration to York Region.Top stories delivered to your inbox."
  },
  {
    "body": "‘My power is through my words': Guelph Indigenous and disability advocate Mike (O’dah ziibing) Ashkewe",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/5/3d/53d09bbb-4500-5350-9f56-eb6bcf09e225/646d4396bc7ae.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/my-power-is-through-my-words-guelph-indigenous-and-disability-advocate-mike-o-dah-ziibing/article_6d6fa322-2db8-5818-9386-dac73d1d6899.html",
    "description": "In celebration of National Indigenous History Month, Metroland introduces readers to 30 Indigenous people who are making a difference. Meet them all online.Mike (O’dah ziibing) Ashkewe is a community activist in the city of Guelph and a freelance writer for the Guelph Mercury Tribune. He is a Sixties Scoop survivor who has written about discovering his sense of belonging.He is known as an independent media producer, writer and broadcaster and the executive producer of This Week in Geek.WHAT DO YOU DO? WHAT IS YOUR CALLING?“Most of the stuff I do here in Guelph, and provincially and federally, is in trying to get people to talk, to create conversations, to create bridges between communities. Not just to get Indigenous groups to talk between each other, but to gather other community members and build something for the future,” Ashkewe said. “You see so many different perspectives and it’s wanting to uplift those voices so they can be heard by those in power to hopefully make those important changes.”WHY IS THAT YOUR PASSION?“One of the big things I believe is there has to be a melding of the old ways and the new ways,” said Ashkewe. I found out as part of my clan, which is Clan Bear, …, that it includes diplomats and politicians — that also means facilitators who are interested in creating conversations.”“I was gifted recently a snapping turtle necklace, and I was told I was powerful in snapping turtle medicine. My power is through my words,” he said. “I figure, the more people I can get talking, that creates something better than one voice.”WHAT DRIVES YOU?“It’s the fact that I never know what tomorrow is going to bring,” said Ashkewe. “For me, it’s always, what’s the next adventure?”WHAT IS THE BEST ADVICE YOU HAVE RECEIVED?“Be teachable,” he said. “Always be learning, always be listening, be willing to be wrong, be willing to be vulnerable.”IF A NON-INDIGENOUS CANADIAN COULD LEARN ABOUT ONE PART OF INDIGENOUS HISTORY THIS MONTH, WHAT SHOULD THAT BE?“From my own personal experience, I would say the Sixties Scoop,\" said Ashkewe. \"That’s where our language and culture was forcibly taken from us, because we were taken from our families.”Top stories delivered to your inbox."
  },
  {
    "body": "Newmarket's Pickering College honours changemakers taking action locally and globally",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/b/ce/bcef75ca-9ce4-5e9d-bc6b-12ba06733709/6474d6d6deb02.image.jpg?resize=200%2C105",
    "url": "https://www.yorkregion.com/news/newmarkets-pickering-college-honours-changemakers-taking-action-locally-and-globally/article_65193de8-f23b-5b7e-b655-b3b0ebf5a0bf.html",
    "description": "Pickering College has honoured changemakers who are taking action locally and globally.At a celebration May 24, the school presented Alumni Keystone and Agent of Change community awards.The awards recognize leaders who are innovative, courageous and compassionate global citizens in their efforts to take action in one of the following areas: community engagement, environmental stewardship, social justice, truth and reconciliation, advocacy, and other meaningful contributions to the community, the school said in a statement.“This event aligns directly with our mission as a school — to instil in each individual the ability and responsibility to make the world greater, better, and more beautiful than they discovered it,” said Cinde Lock, head of school.“Each of the award recipients, in their own way, live and breathe this mission in their daily lives. It is clear that we have a shared purpose to make the world around us better. The collective impact of the nominees, finalists and award winners on our communities is astounding.”Pickering College was founded by Quakers in 1842 and while non-denominational, strives to uphold the Quaker values of simplicity, peace, integrity, compassion, equality and stewardship. Winners of the Agent of Change Award and Alumni Keystone Award have demonstrated these values in their work to make their community a better place, the statement said.The Alumni Keystone award was presented to Nico Macias, who graduated in 2014.Macia's impactful work as an engineer at SpaceX has focused on enhancing the launch rate and reliability of the Falcon vehicle. His work contributed to cost effective satellite missions and the first portion of the Starlink constellation to be placed into orbit. This technology is revolutionizing internet connectivity worldwide, forging new paths for rural and Indigenous communities lacking affordable internet and proving to be a vital tool for disaster relief efforts, demonstrated by its valuable use in Ukraine.Agent of change awards were given to:Gabriel AllahduaAs the activist-in-residence at the University of Guelph, Allahdua brings activists and researchers to work together on migrant issues and amplify each other's work. He provides outreach and support to migrant workers in Ontario and is the author of an eye-opening book on their living and working conditions. His work with politicians aims to change unjust immigration and labour laws and to grant migrant workers status upon arrival in Canada.Megan GlanfieldFounder of Revolution Now!Glanfield is a teacher and founder of Revolution Now!, a sustainable fashion venture established as a response to homophobia and performative allyship in schools. Their purple shirt was created to bring awareness of the lived experience of trans youth and to generate funding for The 519, providing services for 2SLGBTQ+ youth in the GTA. Revolution Now! has grown to provide the same platform for Black and Indigenous youth, spreading messages of inclusivity and social change. The award was accepted on Glanfield's behalf by Noah Wright, the designer behind Revolution Now!'s Black Excellence shirt.Jerisha Grant-HallFounder, Newmarket African Caribbean Canadian Association.Grant-Hall is committed to moving our communities forward through partnerships and bold conversations. She is the founder and chair of the Newmarket African Caribbean Canadian Association which is a non-profit organization that is focused on building community, supporting and strengthening Black families and empowering Black youth. She is driven by the desire to eradicate racial discrimination by cultivating and promoting an inclusive environment where social harmony, mutual respect and human dignity are realized for all.Dr. Gaurav MehtaAs a consultant addiction psychiatrist, Mehta is dedicated to serving vulnerable individuals with serious mental illness and complex needs, many living in shelters or group homes. He sees patients in nine outpatient programs as well as his role as a medical director for in-patients at Southlake Regional Health Centre. He has a keen interest in addiction medicine, electroconvulsive therapy and diabetes. He holds an appointment as adjunct lecturer in psychiatry at the University of Toronto.Blue DoorBlue Door has a long history of providing dignified housing support to vulnerable people in York Region. As the largest emergency housing provider in York Region, Blue Door is committed to addressing the root causes of homelessness, by providing access to innovative and collaborative housing, health, and employment programs and supports.York Region Food NetworkYork Region Food Network is a small organization with a huge impact in York Region, where approximately 25,000 households experience food insecurity. Its programs include community gardens, food classes to develop skills and build community, drop-in breakfasts, and the Good Food Box. It builds spaces where people can enjoy fresh foods, expand social networks and they advocate for the right to food for all.Top stories delivered to your inbox."
  },
  {
    "body": "WHAT'S GOING ON HERE? Demolition of one two-storey building for two townhouse blocks",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/3/de/3de8ec3a-0ca2-5329-ad79-04b0ae906e76/6478ce9da5c38.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/whats-going-on-here-demolition-of-one-two-storey-building-for-two-townhouse-blocks/article_0daccd5f-75d6-559a-a718-bf83c77682ce.html",
    "description": "Heritage Vaughan (an advisory committee to council) is advising Vaughan city council to demolish a two-storey dwelling on Wallace Street.Following a meeting on April 19, Heritage Vaughan came back and recommended the approval of the demolition in order to build a 3.5-storeys blocks of townhouses with four residential units in each at 158-166 Wallace St.THE RECOMMENDATIONS• Any significant changes to the proposal by the owner may require reconsideration by the Heritage Vaughan Committee.• That Heritage Vaughan recommendations to city council does not favour any specific support for any development application under the Ontario Planning Act or permits currently under review or to be submitted in the future by the owner as it relates to the subject application.• That the applicant submit building permit stage architectural drawings and building material specifications to the satisfaction of the Vaughan Development Planning Department.Heritage Vaughan is a committee originally created on May 2, 1977 under the Ontario Heritage Act (OHA) to provide city council with advice on the identification, conservation and preservation of Vaughan’s cultural heritage properties.Top stories delivered to your inbox."
  },
  {
    "body": "Man seriously hurt in Etobicoke industrial accident",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/c/7e/c7e8c941-0ba3-5938-aa35-7e37cfd1a89f/647a2d091ad64.image.jpg?resize=200%2C134",
    "url": "https://www.toronto.com/news/man-seriously-hurt-in-etobicoke-industrial-accident/article_7b8cb0ff-d2a5-5711-b8fc-0a739f796f4c.html",
    "description": "The Ministry of Labour is investigating after a man suffered serious injuries in an industrial accident in Etobicoke Friday morning.The incident happened near Queens Plate Drive and Rexdale Boulevard at 8:29 a.m.Toronto police said they received reports of a worker \"injured on machinery.\"A Toronto Paramedic Services spokesperson said a man, estimated to be in his 30s, suffered \"very serious injuries\" and was taken to a trauma centre.Police said the Ministry of Labour is investigating the incident."
  },
  {
    "body": "Police look for man after stabbing in downtown Toronto",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/0/82/082fbf8d-1369-5c44-9057-188c4a4d1ffc/647a2db57180e.image.jpg?resize=200%2C99",
    "url": "https://www.toronto.com/news/crime/police-look-for-man-after-stabbing-in-downtown-toronto/article_45eac50c-3c6a-5be9-9e4e-df15e74937b2.html",
    "description": "Police are looking for a man in connection with a stabbing early Sunday, May 28 in downtown Toronto.Police said the victim was stabbed several times during an altercation between two groups near Portland and Steward streets at 1:08 a.m.The victim was taken to hospital for treatment. The suspect fled north toward King Street, police said.The suspect is described as six feet tall with a thin build and long black dreadlocks and was wearing a black T-shirt, blue jeans, white shoes, a baseball hat and a necklace, police said in a Friday morning news release in which images of a suspect were released.Anyone with information is asked to call 14 Division at 416-808-1400 or Crime Stoppers anonymously at 416-222-TIPS (8477)."
  },
  {
    "body": "Spectators will be able to tee up at this year's RBC Canadian Open in Toronto",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/0/a8/0a8c5cdd-7066-521f-8298-cacdc61d659f/647a1915162cb.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/spectators-will-be-able-to-tee-up-at-this-years-rbc-canadian-open-in-toronto/article_2f4489cc-6233-5b76-9f00-0d30086df37c.html",
    "description": "Fans will be able to play a hole at North York's Oakdale Golf and Country Club when it hosts the PGA Tour June 6 to 12.The unique spectator experience is possible because the club, nestled south of Jane and Sheppard, has 27 holes on its property, but the PGA’s RBC Canadian Open event needs just 18 of them.“It’s going to be a legit 150-yard-plus par-3, that you get to play like a real hole,” said Aubrey Levy, senior vice-president of marketing and content for theScore, which is sponsoring the hole. “It’s not just come up and take a swing at a simulator or range. You play an entire hole.”Stations will be set up around Oakdale during the Canadian Open where fans can sign up for a time slot at the so-called Hole Zero. Golf carts will pick them up at the station and take them to the extra hole.“We’re going to have coaching on site for you, we’re going to have a caddy, we’re going to kit you out with a locker-room,” said Levy in the news release. “The hope is to make you feel like a pro for a 20-minute block, whether you play like a pro or not.”This is the first time fans will be able to play at a PGA Tour event, albeit on an extra 19th hole, according to theScore Bet.After practice rounds and pro-ams on June 6 and 7, the four-round RBC Canadian Open starts June 8 and runs to June 11 with star Rory McIlroy expected back in as the prestigious event's two-time defending champion, including last year at Etobicoke's St. George's Golf and Country Club.The week includes concerts by the Black Eyed Peas and Alanis Morissette on Friday and Saturday, respectively."
  },
  {
    "body": "Girl critically hurt in pedestrian-struck collision in Etobicoke",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/4/d0/4d01cfe8-7132-5ec6-8229-32d11a6d5288/647a160910c20.image.jpg?resize=200%2C99",
    "url": "https://www.toronto.com/news/girl-critically-hurt-in-pedestrian-struck-collision-in-etobicoke/article_cb3021db-a488-5460-a1a6-144340500622.html",
    "description": "Police are appealing for security and dash camera footage as they investigate a collision in Etobicoke that critically injured a 14-year-old girl.Toronto police said the teen was running north against a red traffic signal at Rexdale Boulevard and Queens Plate Drive when she was struck by an eastbound tractor-trailer around 7:45 a.m. Thursday, June 1.The girl was taken to hospital with life-threatening injuries.The driver of the tractor-trailer remained on scene.Police are asking area residents, businesses and motorists who have security or dash camera footage of the incident to come forward.Anyone with information is asked to call police traffic services at 416-808-1900 or Crime Stoppers anonymously at 416-222-TIPS (8477)."
  },
  {
    "body": "Boy, 16, charged after firecrackers set off on TTC buses in Scarborough",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/0/86/086f4ec0-96ae-5c52-8e16-97c0e692d5f1/6479e49ad1f47.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/crime/boy-16-charged-after-firecrackers-set-off-on-ttc-buses-in-scarborough/article_eb642770-4902-55d3-890d-1b3b2932e05a.html",
    "description": "A teen boy faces charges after firecrackers were set off on TTC buses in Scarborough.Toronto police allege a boy boarded a TTC bus in the Guildwood Parkway and Livingston Road area and threw firecrackers from the bus into a crowd of people waiting at a bus stop May 24. \"The boy exited the TTC bus, and boarded a different TTC bus,\" police said in a news release Thursday night. \"The boy lit and threw a firecracker in the bus, and one person sustained minor injuries.\"Police also allege the same boy set off a firecracker in a TTC bus in the Guildwood neighbourhood May 25. The bus was evacuated as a result of the smoke, though no one was hurt.A 16-year-old boy was arrested Thursday. He is charged with three counts of Mischief, two counts of assault with a weapon and two counts of possessing a weapon for committing an offence. The teen, who can't be identified under the Youth Criminal Justice Act, is scheduled to appear in court on the morning of July 14.Police are asking anyone with information to call 43 Division at 416-808-4300 or Crime Stoppers anonymously at 416-222-TIPS (8477)."
  }
]